In [2]:
import pandas as pd
technologies = {
    'Courses':["Spark","PySpark","Hadoop","Python","pandas"],
    'Fee' :[20000,25000,26000,22000,24000],
    'Duration':['30day','40days','35days','40days','60days'],
    'Discount':[1000,2300,1200,2500,2000]
              }
index_labels=['r1','r2','r3','r4','r5']
df = pd.DataFrame(technologies,index=index_labels)
print(df)

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500
r5   pandas  24000   60days      2000

In [2]:
# Single Row

df.loc['r2']

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [4]:
# Single Column
df.loc[:,"Courses"]

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object

In [5]:
# Multiple Rows

df.loc[['r2','r3']]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

In [7]:
# multiple columns

df.loc[:,["Courses","Fee"]]

    Courses    Fee
r1    Spark  20000
r2  PySpark  25000
r3   Hadoop  26000
r4   Python  22000
r5   pandas  24000

In [17]:
# Selecting alternative Rows

df.loc["r1":"r4":2]

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200

In [16]:
# Selecting Alternative COlumn

df.loc[:,'Fee':'Discount':2]

      Fee  Discount
r1  20000      1000
r2  25000      2300
r3  26000      1200
r4  22000      2500
r5  24000      2000

In [15]:
# Filtering Condition

df.loc[df['Fee']>=24000]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r5   pandas  24000   60days      2000

ILOC

In [3]:
df.iloc[1]

Courses     PySpark
Fee           25000
Duration     40days
Discount       2300
Name: r2, dtype: object

In [4]:
# Select Single Column by Index
df.iloc[:,0]

r1      Spark
r2    PySpark
r3     Hadoop
r4     Python
r5     pandas
Name: Courses, dtype: object

In [5]:

# Select Multiple Rows by Index

df.iloc[[1,2]]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200

In [6]:
# Select Multiple Columns by Index

df.iloc[:,[0,1,3]]

    Courses    Fee  Discount
r1    Spark  20000      1000
r2  PySpark  25000      2300
r3   Hadoop  26000      1200
r4   Python  22000      2500
r5   pandas  24000      2000

In [7]:
# Select Rows Between two Indexs

df.iloc[0:4]

    Courses    Fee Duration  Discount
r1    Spark  20000    30day      1000
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200
r4   Python  22000   40days      2500

In [8]:
# Select Columns between two Indexes
# Includes Index 1 & Execludes 4

df.iloc[:,1:4]

      Fee Duration  Discount
r1  20000    30day      1000
r2  25000   40days      2300
r3  26000   35days      1200
r4  22000   40days      2500
r5  24000   60days      2000

In [9]:
# Select Alternate Rows or Columns
df.iloc[0:4:2]

   Courses    Fee Duration  Discount
r1   Spark  20000    30day      1000
r3  Hadoop  26000   35days      1200

In [10]:
df.iloc[:,1:4:2]

      Fee  Discount
r1  20000      1000
r2  25000      2300
r3  26000      1200
r4  22000      2500
r5  24000      2000

In [11]:
df.iloc[list(df['Fee']>=24500)]

    Courses    Fee Duration  Discount
r2  PySpark  25000   40days      2300
r3   Hadoop  26000   35days      1200